{
    "1": {
        "id": "1",
        "name": "Schnitzel",
        "source": "Cook with Jamie by Jamie Oliver",
        "cooktime": 300,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "To prepare your meat, put the escalopes on to a chopping board, put a piece of wax paper on top and bat the meat with the bottom of a saucepan to flatten in a little - you want to get it to about 1/4 inch thick.\n\nTo breadcrumb your meat, get yourself four large plates and lay them out in a line in the front of you. From left to right, you want to have your slat and pepper in one, flour in the second, beaten egg in the third and your fine breadcrumbs in the fourth. It is very simple...season the pieces of meat and dip them into the flour, shaking off any excess, then put them into the egg, dripping off any excess, and into the breadcrumbs, patting them over both sides and pressing down quite firmly. Gently shake off any excess and put the meat on a board or clean plate ready to be cooked.\n\nHeat a heavy frying pan, add a couple of good glugs of olive oil and, when it is good and hot, put both pieces of pork into the pan. Cook for 2 minutes or so, then carefully start to shake and agitate the pan to cover them in the hot oil. Turn the pork over and continue to cook for a couple of minutes until both sides are crisp and golden brown. Remove to a tray line with paper towels and season with salt and pepper. Put a schnitzel on to each of your serving plates. Put a little pile of cornichon matchsticks and some watercress leaves on top and serve with a big lob of apple sauce, a squeeze of lemon juice and a drizzle of extra virgin olive oil.",
        "ingredients": [
            "2 5.5oz pork escalopes",
            "Salt and pepper",
            "Flour",
            "1 large egg, beaten",
            "1 1/2 cup breadcrumbs",
            "olive oil",
            "10 cornichons, optional for garnish, drained and cut in to matchsticks",
            "1 bunch watercress, washed and dried",
            "1 lemon, optional for serving"
        ],
        "tags": [
            "pork",
            "german",
            "main"
        ],
        "image": "flask/images\\recipe_1.jpg"
    },
    "2": {
        "id": "2",
        "name": "Kale & White Cheddar Quesadillas",
        "source": "Blue Apron",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 1500,
        "servings": 2,
        "comments": "",
        "calories": 1170,
        "fat": 58,
        "satfat": 32,
        "carbs": 100,
        "fiber": 18,
        "sugar": 14,
        "protein": 58,
        "instructions": "In a large pan (nonstick, if you have one), heat 2 teaspoons of olive oil on medium until hot. Add the garlic and kale; season with salt and pepper. Cook, stirring frequently, 1 to 2 minutes, or until the kale is slightly wilted. Add water and taco seasoning, depending on how spicy you’d like the dish to be; season with salt and pepper. Cook, stirring frequently, 3 to 5 minutes, or until the kale has wilted and the water has cooked off. Turn off the heat. Stir in the juice of 2 lime wedges; season with salt and pepper to taste.\r\n\r\nWhile the kale cooks, in a bowl, combine the crème fraîche and the juice of the remaining lime; season with salt and pepper to taste.\r\n\r\nPlace the tortillas on a clean, dry work surface. Divide half the cheese between the two tortillas, only covering half of each tortilla; top with the cooked kale and remaining cheese. Season with salt and pepper. Fold over the tortilla to complete. Wipe out the pan used to cook the kale. Add 2 teaspoons of olive oil and heat on medium-high until hot. Add the quesadillas and cook 2 to 3 minutes per side, or until the tortillas are browned and the cheese has melted. Divide between 2 dishes; immediately season with salt. Set aside in a warm place. Wipe out the pan.\r\n\r\nIn the same pan, heat 2 teaspoons of olive oil on medium until hot. Crack the eggs into the pan, keeping them separate. Season with salt and as much of the remaining spice blend as youd like, depending on how spicy youd like the dish to be. Cook 4 to 5 minutes, or until the whites are set and the yolks are cooked to your desired degree of doneness. Turn off the heat.\r\n\r\nPlace the radishes in a bowl; drizzle with olive oil and season with salt and pepper. Toss to thoroughly coat. Top the cooked quesadillas with the fried eggs and seasoned radishes. Serve with the lime crème fraîche on the side. Enjoy!",
        "ingredients": [
            "4 tsp olive oil",
            "1/2 bunch kale, stems discarded and leaves roughly chopped",
            "1 clove garlic, minced or pressed",
            "1/4 cup water",
            "3/4 tsp taco seasoning",
            "1/2 lime, juiced",
            "3 oz white cheddar Cheese",
            "2 large flour tortillas",
            "",
            "1/2 lime, juiced",
            "2 tbsp Creme Fraiche",
            "",
            "2 tsp olive oil, plus more for drizzling on radishes",
            "1/4 tsp taco seasoning",
            "3 Radishes, halved lengthwise then thinly sliced crosswise",
            "2 Eggs"
        ],
        "tags": [
            "vegetarian",
            "main"
        ],
        "image": "flask/images\\recipe_2.jpg"
    },
    "3": {
        "id": "3",
        "name": "Pecan Pie",
        "source": "http://chowhound.chow.com/topics/281175#1495442",
        "cooktime": 0,
        "servings": 12,
        "comments": "Does not use corn syrup",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 350F. In a large saucepan, heat the brown sugar, golden syrup and butter to the boiling point. Stirring constantly and scraping back any foam that clings to the side of the pan, let this mixture boil for about 1 minute. Remove from the heat and let cool while, in a separate bowl, you beat the eggs until creamy. \n\nWhen the boiled syrup has cooled, beat in the eggs, salt and pecans. Pour into the unbaked pie shell and bake for about 50 minutes.\n\nNotes:\n\n* A little cream (about 1/4 to 1/2 cup) mixed into a pecan pie filling before baking gives it a richer, lighter texture. \n\n* For a sweeter, lighter pie: add more sugar and use fewer pecans; for a denser, less sweet pie: add more pecans and use less sugar. \n\n* The buttery flavour and the lard-induced flakiness of a butter and lard crust make it the perfect one for a perfect pecan pie. And a Southern pecan pie authority I know suggests that you roll out the dough a little thicker than usual; a thick, richly shortened crust provides an appetizing balance to the sweetness of the filling. ",
        "ingredients": [
            "1/4 tsp salt ",
            "3 eggs ",
            "4 tbsp butter ",
            "2 tbsp dark rum ",
            "2/3 cup golden syrup ",
            "1 cup dark brown sugar, well-packed",
            "2 cup pecans, chopped ",
            "9-inch unbaked pie shell"
        ],
        "tags": [
            "dessert",
            "pie",
            "untried"
        ],
        "image": "flask/images\\recipe_3.jpg"
    },
    "4": {
        "id": "4",
        "name": "Smoked Salmon Ebelskivers",
        "source": "Ebelskivers by Kevin Crafts",
        "cooktime": 1080,
        "servings": 3,
        "comments": "If dill is not available, add 1 tsp of Old Bay seasoning to the batter in place of the salt and pepper.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat oven to 200F.\n\nIn a large bowl, whisk together the flour, sugar, baking powder, salt, and pepper. In a small bowl, lightly whisk the egg yolks, then whisk in the milk, 2 tablespoons of melted butter and lemon juice. Add the yolk mixture to the flour mixture and, using a wooden spoon, stir until well blended. The batter will be lumpy.\n\nIn a clean bowl, using an electric mixer on high speed, beat the egg whites until stiff, but not dry, peaks form. Using a silicone spatula, fold about one-third of the egg whites into the batter to lighten it, then fold in the rest just until no white streaks remain. Stir in fresh dill.\n\nBrush the wells of the ebelskiver pan with some of the remaining melted butter and place over medium heat. When the butter starts to bubble, add about 1 tablespoon batter to each well. Working quickly, carefully spoon about 1/2 teaspoon of the smoked salmon into the center of each pancake, then spoon about 1/2 teaspoon of the cream cheese on top. Top each with another 1 tablespoon batter. (Alternatively, gently mix the cream cheese and salmon together. Spoon about 1 teaspoon into the center of each pancake)\n\nCook until the bottoms of the pancakes are lightly browned and crisp, 3-5 minutes. Use 2 short wooden skewers to turn all the  pancakes and cook until lightly browned on the second side, about 3 minutes longer.\n\nTransfer the finished pancakes to a platter and keep warm  in the oven while you repeat to make 2 more batches. Serve right away.",
        "ingredients": [
            "1 cup all-purpose flour",
            "1 1/2 tsp sugar",
            "1/2 tsp baking powder",
            "1/4 tsp salt",
            "1/2 tsp pepper, freshly ground",
            "2 large eggs, separated",
            "1 cup milk",
            "3 tbsp unsalted butter, melted and slightly cooled, divided use",
            "1 tsp fresh lemon juice",
            "1/4 cup fresh dill, chopped and firmly packed",
            "3 1/2 tbsp smoked salmon, minced (about 4 oz)",
            "3 1/2 tbsp whipped-style cream cheese, at room temperature",
            "2 servings [cocktail sauce](http://www.xanthir.com/recipes/showrecipe.php?id=id50)"
        ],
        "tags": [
            "salmon",
            "ebelskivers",
            "main"
        ],
        "image": "flask/images\\recipe_4.jpg"
    },
    "5": {
        "id": "5",
        "name": "Shrimp Scampi",
        "source": "Ina Garten: Barefoot Contessa Back to Basics",
        "cooktime": 0,
        "servings": 6,
        "comments": "Modified by reducing butter and salt.  Substituted frozen shrimp instead of fresh 12-15 count (butterflied, tails on).",
        "calories": 2565,
        "fat": 159,
        "satfat": 67,
        "carbs": 76,
        "fiber": 4,
        "sugar": 6,
        "protein": 200,
        "instructions": "Preheat the oven to 425 degrees F.\n\nDefrost shrimp by putting in cold water, then drain and toss with wine, oil, salt, and pepper. Place in oven-safe dish and allow to sit at room temperature while you make the butter and garlic mixture.\n\nIn a small bowl, mash the softened butter with the rest of the ingredients and some salt and pepper.\n\nSpread the butter mixture evenly over the shrimp. Bake for 10 to 12 minutes until hot and bubbly. If you like the top browned, place under a broiler for 1-3 minutes (keep an eye on it). Serve with lemon wedges and French bread.\n\nNote: if using fresh shrimp, arrange for presentation. Starting from the outer edge of a 14-inch oval gratin dish, arrange the shrimp in a single layer cut side down with the tails curling up and towards the center of the dish. Pour the remaining marinade over the shrimp. ",
        "ingredients": [
            "2/3 cup panko",
            "1/4 teaspoon red pepper flakes",
            "1/2 lemon, zested and juiced",
            "1 extra-large egg yolk",
            "1 teaspoon rosemary, minced",
            "3 tablespoon parsley, minced",
            "4 clove garlic, minced",
            "1/4 cup shallots, minced",
            "8 tablespoon unsalted butter, softened at room temperature",
            "2 tablespoon dry white wine",
            "Freshly ground black pepper",
            "Kosher salt",
            "3 tablespoon olive oil",
            "2 pound frozen shrimp"
        ],
        "tags": [
            "seafood",
            "shrimp",
            "main"
        ],
        "image": "flask/images\\recipe_5.jpg"
    },
    "6": {
        "id": "id6",
        "name": "Shepherds Pie",
        "source": "Hello fresh",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 3000,
        "servings": 2,
        "comments": "",
        "calories": 1352,
        "fat": 77,
        "satfat": 33,
        "carbs": 135,
        "fiber": 16,
        "sugar": 32,
        "protein": 34,
        "instructions": "Place potatoes in a large pot with enough salted water to cover by 2 inches. Bring to a boil and cook until tender, 15-20 minutes. Reserve 1/2 cup potato cooking liquid then drain and return potatoes to pot. Keep covered off heat until ready to mash.\r\n\r\nWhile potatoes cook, heat a large drizzle of olive oil in a medium, preferably ovenproof, pan over medium-high heat. Add mushrooms and a big pinch of salt. Cook, stirring occasionally until lightly browned, 5 minutes.  Add a drizzle of olive oil to pan then stir in carrots, onion, and salt. Cook, stirring, until veggies are softened, 5-7 minutes more.\r\n\r\nStir butter into pan with veggies until melted, then add thyme, garlic powder, and flour. Cook, stirring, 1 minute. Stir in tomato paste until incorporated, 1 minutes. Pour in water and stock concentrate, scraping up any browned bits from bottom of pan. Bring to a boil, then reduce to a low simmer and cook until sauce has thickened, 2-3 minutes. Season with salt and pepper to taste. Turn off heat. If you pan isnt ovenproof, transfer mixture now to a baking dish.\r\n\r\nMash drained potatoes with sour cream, cheddar and butter until smooth and creamy, adding splashes of reserved potato cooking liquid as needed. Season with salt and pepper.\r\n\r\nHeat broiler to high. Once filling has thickened, spoon mashed potatoes on top. Spread into an even layer, leaving a 1-inch border around edge of pan. Sprinkle potatoes with remaining cheddar. Broil until cheese is lightly browned, 3-4 minutes. Watch carefully to avoid burning. Let rest as least 5 minutes, then divide between plates and serve.\r\n",
        "ingredients": [
            "16 oz Yukon gold potatoes, diced into 1/2-inch pieces",
            "",
            "8 oz button mushrooms, trimmed and quartered",
            "6 oz carrots, finely diced",
            "1/2 yellow onion, diced",
            "1 tbsp butter",
            "1 1/2 tsp fresh thyme, finely chopped",
            "1 tsp garlic powder",
            "1 tbsp flour",
            "1.5 oz tomato paste",
            "3/4 cup water",
            "2 tsp vegetable stock concentrate",
            "2 tbsp sour cream",
            "1/4 cup white cheddar, shredded",
            "2 tbsp butter",
            "1/4 cup white cheddar, shredded",
            "Olive oil",
            "Salt and pepper"
        ],
        "tags": [
            "vegetarian",
            "main"
        ],
        "image": "flask/images\\recipe_6.jpg"
    },
    "7": {
        "id": "7",
        "name": "black bean soup",
        "source": "Hello fresh",
        "preptime": 300,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 2,
        "comments": "bbq sauce and taco seasoning subbed for tex-mex paste. sour cream and smoked paprika subbed for smoky red pepper crema",
        "calories": 1240,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Heat a large drizzle of oil in a large pot over medium-high heat. Add onion and scallion whites. Cook stirring until softened, 3-4 minutes. Add southwest spice, stir until fragrant, 30 seconds. Stir in diced tomato, tomato paste, BBQ sauce and taco seasoning, cook until slightly darkened in color, 1 minute.\r\n\r\nStir in vegetable stock, beans and reserved bean liquid into pot. Bring to a boil and cook, stirring occasionally, until thickened 5-8 minutes. Taste and season with salt and pepper. Turn off heat.\r\n\r\nMeanwhile, in a small bowl, mix sour cream and smoked paprika. Season to taste with salt and pepper.\r\n\r\nDivide soup between bowls and top with scallion greens, cheddar, smoky sour cream, and as many crushed tortilla chips as youd like. Serve with remaining whole tortilla chips on the side.",
        "ingredients": [
            "1 medium yellow onion, diced",
            "2 green onions, thinly sliced, separate whites from greens",
            "1 tbsp southwest spice",
            "1 Roma tomato, diced",
            "1.5 oz tomato paste",
            "1 tbsp BBQ sauce",
            "1 1/2 tbsp taco seasoning",
            "2 cup vegetable stock",
            "1 14oz can black beans, drained and liquid reserved",
            "1/4 cup reserved bean liquid",
            "olive oil",
            "salt and pepper",
            "",
            "2 tbsp sour cream",
            "1/4 tsp smoked paprika",
            "1 1/2 oz tortilla chips",
            "1/2 cup cheddar, shredded"
        ],
        "tags": [
            "vegetarian",
            "main",
            "soup"
        ],
        "image": "flask/images\\recipe_7.jpg"
    },
    "8": {
        "id": "8",
        "name": "Old Fashioned Vegetable Soup",
        "source": "Lee Ann Foulger",
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large soup pot, brown ground beef and onion, drain off fat.  Add remaining ingredients EXCEPT for last 3 items (canned vegetables).  Simmer on low heat until vegetables are tender, about an hour.  Add canned vegetables and simmer 5 minutes.  Remove bay leaf and serve.",
        "ingredients": [
            "1 pound ground beef",
            "1 cup onion, chopped",
            "1 cup potatoes, diced",
            "1 cup carrots, sliced",
            "1 cup celery, diced",
            "2 16oz can diced tomatoes in juice (or substitute 2 small cans of tomato sauce)",
            "4 cup water",
            "1/4 tsp dried basil, crushed",
            "1/4 tsp dried thyme",
            "1 bay leaf",
            "1/2 tsp salt",
            "1/4 tsp pepper",
            "1/2 tsp garlic powder",
            "2 tablespoon beef bouillon",
            "1 16oz can corn",
            "1 16oz can green beans",
            "1 16oz can green peas"
        ],
        "tags": [
            "soup",
            "beef",
            "family_recipes",
            "main"
        ],
        "image": "flask/images\\recipe_8.jpg"
    },
    "9": {
        "id": "9",
        "name": "Onion Pie",
        "source": "Houston Chronicle 1/18/2006",
        "cooktime": 0,
        "servings": 6,
        "comments": "only 4 cups onions? Needs more crust - try 1.25 cups cracker crumbs? Experiment with red pepper - try 1/4tsp.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 400 degrees halfway through onion cooking.\n\nSlice the onions and saute in 4 tablespoons butter over medium-low heat; the longer you cook them - as long as 35 minutes - the sweeter they will be.  Sprinkle in crushed red pepper.\n\nMelt the remaining 4 tablespoons butter.  Mix with the crushed crackers, then press the mixture into the bottom and sides of a glass pie plate to form a crust.  Prebake crust for 10 minutes.\n\nLightly beat the eggs and milk together in a small bowl.\n\nSpoon the onions into the crust, then pour the egg mixture over them.  Sprinkle with Parmesan.\n\nBake for 30-40 minutes until set and golden.",
        "ingredients": [
            "1/2 cup grated Parmesan cheese",
            "1/2 stack Keebler Club Crackers, crushed",
            "2 eggs",
            "1 cup milk",
            "1/2 teaspoon crushed red pepper flakes, or to taste",
            "1/2 cup butter, divided use",
            "3 large onions"
        ],
        "tags": [
            "onion",
            "casserole",
            "main",
            "vegetarian"
        ],
        "image": "flask/images\\recipe_9.jpg"
    },
    "10": {
        "id": "10",
        "name": "Cheesecake",
        "source": "Godiva.com, Chef Morgan Wilson",
        "cooktime": 0,
        "servings": 10,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a food processor with a blade attachment, cream the cheese until smooth and then add in sugar. Pulse a couple times to incorporate sugar and cocoa powder. Add in eggs and yolks pulsing a couple times again and scrape down to ensure all is smooth and uniform. With machine running, pour in melted Godiva Chocolate in a steady stream until all in, and finish by pulsing in the crème fraiche. Pour batter into a 10\" x 10\" baking pan and bake at 325 for 30, minutes or until custard is set and a toothpick inserted in center can be removed cleanly. The top may caramelize or brown slightly, which is not an issue. Once set, remove from oven and allow cheesecake to cool completely. Wrap the pan with plastic and reserve in cooler to set and chill completely.\n\nOnce the cheesecake is cold and firm, remove it from the pan and place in a mixer bowl with a paddle attachment. Beat the cake for a few moments to soften and smooth out the custard. Place smoothed custard into a piping bag with a plain tip and pipe into the bottom of a plastic lined half cylinder mold. Tap the mold to ensure the custard is solid and then flatten out to top. Freeze the mold to harden the custard for unmolding. Once the cake can be unmolded, remove from the pan and cut into 1½\" sections. Brush some tempered Godiva Dark Chocolate onto a strip of acetate and, while it is still fluid, smooth over the top of the molded cheesecake. Once the chocolate has cooled and completely crystallized, remove the acetate, revealing a shiny and textured chocolate finish.",
        "ingredients": [
            "2 1/2 cup cream cheese, room temperature",
            "1/2 cup sugar",
            "1 3/4 tablespoon cocoa powder",
            "5 tablespoon Godiva 85% Dark Chocolate Callets",
            "2 eggs",
            "2 egg yolks",
            "1 3/4 tablespoon crème faiche"
        ],
        "tags": [
            "cheesecake",
            "dessert",
            "pie",
            "chocolate",
            "untried"
        ],
        "image": "flask/images\\recipe_10.jpg"
    },
    "11": {
        "id": "11",
        "name": "Greek Salad",
        "source": "Food Network (two different recipes)",
        "cooktime": 0,
        "servings": 4,
        "comments": "Dried oregano can also be substituted for the fresh in the salad mix.  Only use 1/2-1 teaspoon of the dried.",
        "calories": 3057,
        "fat": 297,
        "satfat": 63,
        "carbs": 78,
        "fiber": 23,
        "sugar": 34,
        "protein": 42,
        "instructions": "In a small bowl, whisk together the lemon juice, garlic, salt, and oil. Set aside.   In a large bowl lightly toss the lettuce with the olives, cheese, cucumber, tomatoes, onion, oregano, and black pepper. Let sit up to 2 hours.  To serve, toss salad with dressing and place sliced chicken on top.",
        "ingredients": [
            "6 tablespoon lemon juice",
            "2 clove garlic, minced",
            "2 teaspoon kosher salt, plus more to taste",
            "1 cup extra-virgin olive oil, preferably Greek",
            "",
            "1 head romaine lettuce, trimmed of tough stems and torn into bite-sized pieces",
            "1 cup kalamata olives, about 6oz/cup",
            "1/2 pound Feta cheese, crumbled",
            "1 cucumber, trimmed, cut into 1 inch chunks",
            "1 1/2 cup grape tomatoes, halved",
            "1 small red onion, cut into 1/2-inch wedges, soaked in cold water for 5 minutes and drained",
            "2 teaspoon dried oregano",
            "Freshly ground black pepper"
        ],
        "tags": [
            "main",
            "greek",
            "salad",
            "dressing"
        ],
        "image": "flask/images\\recipe_11.jpg"
    },
    "12": {
        "id": "12",
        "name": "Kimchi",
        "source": "https://www.koreanbapsang.com/kimchi-jeon-kimchi-pancake/",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 720,
        "servings": 4,
        "comments": "",
        "calories": 1405,
        "fat": 49,
        "satfat": 17,
        "carbs": 197,
        "fiber": 13,
        "sugar": 21,
        "protein": 36,
        "instructions": "In a large bowl, combine the flour (or pancake mix) with the liquid from kimchi and egg, and water, a little bite at a time. Do not over mix. Add a little more water if the batter is too thick. The batter should flow easily from a spoon. Stir in the kimchi, scallions, and onion.\r\n\r\nIn a small bowl, combine all dipping sauce ingredients.\r\n\r\nHeat one tablespoon of oil in a non-stick pan over medium heat. Ladle the mixture into the pan, and spread it evenly into a thin round shape. Cook until the edges turn light golden brown, about 3 minutes. Turn it over, and add more oil to the sides of the pan. Gently swirl the pan to distribute the oil under the pancakes. Press the pancake down with a spatula. Cook until the other side is nicely browned and crispy, 2 to 3 minutes.\r\n\r\nRepeat the process until there is no remaining batter. Serve hot with a dipping sauce, if desired.\r\n\r\n-----\r\n\r\nTips for making kimchi pancakes:\r\n1. Use juice/liquid from kimchi if at all possible.\r\n2. Use icy cold water.\r\n3. The batter should be thin enough to flow easily from a spoon.\r\n4. Spread the batter thin when pan frying.\r\n5. Use a generous amount of oil.\r\n6. Increase the heat a little to crisp up the pancakes at the end of pan-frying.",
        "ingredients": [
            "1 cup fully-fermented kimchi, thinly sliced",
            "1 scallion, cut into about 2-inch pieces, if white part is thick, cut in half lengthwise",
            "1/4 medium onion, thinly sliced",
            "cooking oil with high smoke point for pan frying",
            "",
            "1 cup all-purpose flour, or buchimgaru (Korean pancake premix)",
            "1/4 cup sweet rice flour or potato starch, substitute with additional AP flour if unavailable",
            "2 tablespoon juice/liquid from kimchi, may need a little more, See note on water below",
            "1 egg, lightly beaten",
            "1 cup icy cold water, Use more water if juice/liquid from kimchi is unavailable and not using an egg. Flour to liquid should be about 1:1 ratio in total.",
            "",
            "1 tablespoon soy sauce",
            "1 teaspoon vinegar",
            "1 tablespoon water",
            "1/2 teaspoon sugar",
            "pinch of black pepper"
        ],
        "tags": [
            "sides",
            "untried"
        ],
        "image": "flask/images\\recipe_12.jpg"
    },
    "13": {
        "id": "13",
        "name": "Sweet potato fajitas",
        "source": "Hello fresh",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 1500,
        "servings": 2,
        "comments": "",
        "calories": 1218,
        "fat": 58,
        "satfat": 22,
        "carbs": 146,
        "fiber": 20,
        "sugar": 36,
        "protein": 34,
        "instructions": "1. Adjust rack to top position and preheat oven to 425F. Toss sweet potato wedges with a large drizzle of olive oil and fajita seasoning. Season with salt if the fajita seasoning doesnt include salt. Cook for 25-30 minutes, until slightly crispy.\r\n\r\n2. Small dice 1/4 cup (for 2 servings) of the onion for the salsa. Slice the rest.\r\n\r\n3. Heat a drizzle of oil in a large pan over medium heat. Add sliced onion and green pepper. Cook stirring occasionally, until softened and lightly charred, 8-10 minutes. Season with salt and pepper. Remove pan from heat.\r\n\r\n3. While veggies cook, in a small bowl, combine tomato, cilantro, diced onion, and a squeeze of lime juice. Season with salt and pepper. In a separate bowl, combine sour cream, lime zest, and a squeeze of lime juice to make it slightly thinner if needed. Season with salt and pepper.\r\n\r\n4. Heat tortillas using desired method. Divide tortillas between plats and fill with sweet potatoes, veggies, pepper jack, salsa, lime sour cream, and as much pickled jalapeno as you like. Enjoy!\r\n\r\nNote: Southwest seasoning can be made with 2 parts garlic powder, 1 part cumin, and 1 part chili powder.",
        "ingredients": [
            "2 sweet potatoes, cut into 1/2-inch thick wedges",
            "1 tsp fajita or southwest seasoning",
            "",
            "1 yellow onion, divided, sliced/diced",
            "1 green bell pepper",
            "",
            "1 roma tomato, small diced",
            "1 tbsp fresh cilantro, roughly chopped",
            "1 lime, zested and juiced (probably wont need all the juice)",
            "2 tbsp sour cream",
            "",
            "4 small flour tortillas",
            "1/2 cup pepper jack cheese, shredded",
            "1 oz pickled jalapeno"
        ],
        "tags": [
            "vegetarian",
            "main"
        ],
        "image": "flask/images\\recipe_13.jpg"
    },
    "14": {
        "id": "14",
        "name": "Spinach-Ricotta Ravioli",
        "source": "Hello Fresh",
        "preptime": 600,
        "waittime": 0,
        "cooktime": 2400,
        "servings": 2,
        "comments": "",
        "calories": 1280,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Preheat oven to 400F. Toss bell pepper and tomatoes with oil, salt, and pepper, and roast 20-25 minutes, until softened and lightly charred. Transfer to a cutting board and thinly slice.\r\n\r\n2. When veggies are half done, bring a pot of water to boil. Add ravioli, and simmer until al dente and floating, 4-5 minutes. Reserve 1/2 cup pasta water, drain the rest, and set ravioli aside.\r\n\r\n3. Melt half the butter in pan and saute garlic until softened, 2-3 minutes. Add 1/4 cup reserved pasta water, stock, cream cheese, sour cream, and remaining butter. Whisk until combined and creamy, then add veggies. Add lemon juice and season to taste.\r\n\r\n4. Add ravioli to sauce, gently toss until thoroughly coated. Serve, topping with parmesan.",
        "ingredients": [
            "1 bell pepper, halved",
            "1 roma tomato, cut into wedges (4-6 per tomato)",
            "2 tbsp butter, divided",
            "2 clove garlic, thinly sliced",
            "9 oz ravioli (spinach and ricotta)",
            "1/4 tsp vegetable stock concentrate",
            "1 tbsp lemon juice",
            "2 tbsp cream cheese",
            "2 tbsp sour cream",
            "1/4 cup parmesan cheese"
        ],
        "tags": [
            "vegetarian",
            "main"
        ],
        "image": "flask/images\\recipe_14.jpg"
    },
    "15": {
        "id": "15",
        "name": "Margherita Salad",
        "source": "Adapted from Food Network Magazine (Chicken Parmesan Salad)",
        "cooktime": 0,
        "servings": 4,
        "comments": "I like to use home made bread crumbs instead of store bought.  They stay crispier on the salad.",
        "calories": 2883,
        "fat": 164,
        "satfat": 54,
        "carbs": 120,
        "fiber": 15,
        "sugar": 27,
        "protein": 227,
        "instructions": "Puree the plum tomato, sun-dried tomatoes, vinegar, garlic, oregano, a basil leaves and parmesan in a blender, drizzling in the sun-dried tomato oil until smooth. Add 2 to 3 tablespoons water, if needed to make a pour-able dressing; season with salt and pepper.\n\nHeat the olive oil in a large skillet over medium-high heat. Add the breadcrumbs, season with salt and pepper and cook, stirring occasionally, until golden, about 2 minutes. Add the remaining parmesan and the parsley and cook until toasted, about 1 more minute.\n\nToss the salad greens, mozzarella, and remaining basil in a large bowl. Toss with the dressing, then sprinkle with the breadcrumb mixture.",
        "ingredients": [
            "1 plum tomato, halved",
            "4 sun-dried tomatoes packed in oil",
            "2 tablespoon oil from the sun-dried tomato jar",
            "2 tablespoon red wine vinegar",
            "1 clove garlic",
            "1/2 teaspoon dried oregano",
            "1/4 bunch fresh basil, torn",
            "2 tbsp parmesan, grated",
            "Kosher salt and freshly ground pepper",
            "",
            "2 tablespoon extra-virgin olive oil",
            "1 cup breadcrumbs",
            "2 tablespoon chopped fresh parsley",
            "1/4 cup parmesan, grated",
            "",
            "8 cup Italian-blend salad greens",
            "3/4 bunch fresh basil, chiffonade",
            "8 ounce bocconcini (mozzarella), quartered"
        ],
        "tags": [
            "salad",
            "dressing",
            "main"
        ],
        "image": "flask/images\\recipe_15.jpg"
    },
    "16": {
        "id": "16",
        "name": "Mexican Ensalada",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 1335,
        "fat": 62,
        "satfat": 9,
        "carbs": 172,
        "fiber": 37,
        "sugar": 13,
        "protein": 35,
        "instructions": "In small bowl, whisk together dressing ingredients.\n\nChop up additional ingredients bite size and add to a medium bowl.\n\nCombine dressing and all ingredients in a large bowl, toss, and serve.\n\nIncludes recipe for [basil-lime vinaigrette](http://www.xanthir.com/recipes/showrecipe.php?id=id6).\n\nAlternate dressing (for 2 servings):\n1/2 lemon, juiced; 1 tbsp apple cider vinegar; 2 tbsp olive oil; 2 tablespoons cilantro, chopped",
        "ingredients": [
            "1 lime, zested and juiced",
            "1 tablespoon balsamic vinegar",
            "1/4 cup basil leaves, chopped",
            "1/2 teaspoon cumin",
            "2 tablespoon extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper",
            "",
            "1/2 cucumber, cubed",
            "1 avocado, cubed",
            "1 red bell pepper, cubed",
            "1/2 cup black beans, rinsed and drained",
            "1 tomato, cubed",
            "1/2 cup brown rice, cooked"
        ],
        "tags": [
            "salad",
            "mexican",
            "FUF",
            "main",
            "vegetarian"
        ],
        "image": "flask/images\\recipe_16.jpg"
    },
    "17": {
        "id": "17",
        "name": "Guacamole",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 1552,
        "fat": 120,
        "satfat": 16,
        "carbs": 72,
        "fiber": 64,
        "sugar": 16,
        "protein": 24,
        "instructions": "1. Place all ingredients in a bowl with a flat bottom and mash it with a potato masher.  Alternatively, you can mix everything briefly in a food processor.\n2. Stir well and keep refrigerated. This dish will brown on the areas exposed to air within a few hours, so serve it shortly after making it or just stir again before serving.",
        "ingredients": [
            "4 ripe avocados",
            "2 roma tomatoes, diced fine",
            "1/2 red onion, minced",
            "1/2 handful cilantro, minced",
            "2 clove garlic, minced",
            "1 lime, juiced",
            "Pinch of sea salt",
            "1 jalapeno, seeded and minced fine"
        ],
        "tags": [
            "dip",
            "appetizer",
            "mexican",
            "FUF",
            "sides"
        ],
        "image": "flask/images\\recipe_17.jpg"
    },
    "18": {
        "id": "18",
        "name": "Sweet Almond Date Smoothie",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 716,
        "fat": 25,
        "satfat": 2,
        "carbs": 123,
        "fiber": 12,
        "sugar": 90,
        "protein": 9,
        "instructions": "Combine all ingredients in blender. Blend until smooth.",
        "ingredients": [
            "1 banana",
            "2 tbsp almond butter",
            "6 dates",
            "1 tsp maple syrup",
            "2 tsp cinnamon",
            "2 cup almond milk, or skim milk"
        ],
        "tags": [
            "smoothie",
            "FUF",
            "breakfast"
        ],
        "image": "flask/images\\recipe_18.jpg"
    },
    "19": {
        "id": "19",
        "name": "Super Protein Salad",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 684,
        "fat": 35,
        "satfat": 5,
        "carbs": 73,
        "fiber": 20,
        "sugar": 13,
        "protein": 24,
        "instructions": "Combine olive oil, vinegar, mustard, salt and pepper to taste. Toss with other ingredients in a bowl and serve.",
        "ingredients": [
            "2 cup salad greens",
            "1/4 cucumber, sliced",
            "1/2 cup grape tomatoes",
            "1/4 cup black beans, drained and rinsed",
            "1/4 cup chickpeas, drained and rinsed",
            "1 tbsp pistachios",
            "2 tbsp dried cranberries",
            "",
            "salt and pepper, to taste",
            "2 tbsp olive oil",
            "1 tbsp red wine vinegar",
            "1 tsp Dijon mustard"
        ],
        "tags": [
            "salad",
            "beans",
            "FUF",
            "main"
        ],
        "image": "flask/images\\recipe_19.jpg"
    },
    "20": {
        "id": "20",
        "name": "Chocolate Cupcakes",
        "source": "https://www.kingarthurflour.com/recipes/chocolate-cake-recipe and https://www.kingarthurflour.com/recipes/super-simple-chocolate-frosting-recipe",
        "preptime": 2400,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 18,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 350°F. Lightly grease and flour your choice of pans: one 9\" x 13\" pan, two 9\" round pans, or three 8\" round pans.\r\n\r\nSift together the flour, baking powder, baking soda, salt, cocoa, and sugar into a large mixing bowl.\r\n\r\nAdd the butter and mix at low speed for 1 minute. With the mixer running, add the oil and continue mixing until the mixture looks sandy, about 30 seconds more.\r\n\r\nIn a large measuring cup, combine the vanilla with the milk and coffee(or water), and add all at once to the dry ingredients. Mix for 1 minute at low speed, stop and scrape the sides and bottom of the bowl, then mix for 30 seconds more.\r\n\r\nAdd the eggs one at a time, beating well at medium-high speed between additions.\r\n\r\nScrape the sides and bottom of the mixing bowl, and mix for 30 seconds more. The batter will be thin.\r\n\r\nTransfer the batter to the prepared pan(s) of your choice. Smooth out the tops of the layers with an offset spatula.\r\n\r\nBake for 34 minutes for a 9\" x 13\" pan, 28 to 30 minutes for 9\" layers, and 24 to 26 minutes for 8\" layers. (Try 16-18 minutes for cupcakes?)\r\n\r\nThe cake is done when the top springs back when very lightly touched in the center, and the edges just begin to pull away from the edge of the pan. A cake tester inserted in the center will come out clean.\r\n\r\n------\r\n\r\nSift or sieve the cocoa, 1 1/2 cups confectioners sugar and espresso powder, if youre using it, into a bowl.\r\n\r\nBring the cream to a simmer on the stove or in the microwave, and whisk into the cocoa mixture. At first the mixture will look grainy; continue whisking for a minute. Youll see the lumps disappear as the sugar dissolves and the cocoa hydrates. Set aside to cool to room temperature.\r\n\r\nPlace the butter, salt, and 2 cups sifted or sieved confectioners sugar in a large mixing bowl. Beat until the mixture is smooth and fluffy. Beat in the vanilla.\r\n\r\nWith the mixer running on low speed, add the cocoa mixture a spoonful at a time until its all incorporated. Scrape the bowl, then beat at medium speed for one minute more. Use to frost cake as needed.",
        "ingredients": [
            "2 1/4 cup unbleached all-purpose flour",
            "1 1/2 teaspoon baking powder",
            "1/2 teaspoon baking soda",
            "1/2 teaspoon salt",
            "3/4 cup unsweetened cocoa (natural or Dutch-process cocoa)",
            "1 3/4 cup granulated sugar",
            "8 tbsp unsalted butter, at room temperature",
            "1/3 cup vegetable oil",
            "2 teaspoon vanilla extract",
            "1 cup milk",
            "1/2 cup coffee or water",
            "4 large eggs",
            "",
            "1 3/4 cup unsweetened baking cocoa",
            "1 1/2 cup confectioners sugar",
            "1 teaspoon espresso powder, optional, for enhanced chocolate flavor",
            "1 cup heavy cream",
            "1 cup unsalted butter, very soft",
            "1/8 teaspoon salt",
            "2 cup confectioners sugar, sifted",
            "2 teaspoon vanilla extract"
        ],
        "tags": [
            "dessert"
        ],
        "image": "flask/images\\recipe_20.jpg"
    },
    "21": {
        "id": "21",
        "name": "Vanilla Cupcakes",
        "source": "https://www.kingarthurflour.com/recipes/ultra-vanilla-cupcakes-with-easy-vanilla-frosting-recipe",
        "preptime": 1800,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 375°F. Grease a standard muffin pan, or line with greased cupcake papers.\r\n\r\nTo make the cupcakes: Combine the dry ingredients, then mix in the butter until crumbly.\r\n\r\nWhisk together the eggs, milk, and vanilla. Stir the wet ingredients into the dry in two additions.\r\n\r\nScoop about 1/3 cup batter into each muffin cup.\r\n\r\nBake the cupcakes for 16 to 18 minutes, until theyre lightly browned and a toothpick inserted into the center of one of the middle cupcakes comes out clean.\r\n\r\nRemove the cupcakes from the oven; after 5 minutes turn them out of the pan onto a rack to cool.\r\n\r\nTo make the frosting: Beat together the butter, shortening, and salt.\r\n\r\nAdd the sugar, vanilla, and ¼ cup milk, and beat until fluffy. Add additional milk if the frosting seems too stiff to spread.\r\n\r\nUse a cupcake corer or small spoon to scoop some of the center out of each cupcake. Fill and ice with the frosting. Yields 12 cupcakes.",
        "ingredients": [
            "1 1/2 cup unbleached cake flour",
            "1 cup granulated sugar",
            "1 1/2 tsp baking powder",
            "1/4 tps salt",
            "6 tbsp unsalted butter, softened",
            "2 large eggs",
            "1/2 cup milk",
            "2 teaspoon vanilla extract",
            "",
            "6 tbsp unsalted butter, softened",
            "1/3 cup vegetable shortening",
            "1/8 tsp salt",
            "4 cup confectioners sugar",
            "2 tsp vanilla extract",
            "1/4 cup milk"
        ],
        "tags": [
            "dessert"
        ],
        "image": "flask/images\\recipe_21.jpg"
    },
    "22": {
        "id": "22",
        "name": "Shrimp fried rice",
        "source": "http://www.simplyrecipes.com/recipes/shrimp_fried_rice/",
        "preptime": 900,
        "waittime": 600,
        "cooktime": 300,
        "servings": 4,
        "comments": "Use day old, leftover rice. Fresh rice will make it mushy.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1 In a bowl, toss the shrimp with the salt, pepper and cornstarch. Let marinate for 10 minutes at room temperature. Heat a wok or large sauté pan on high heat. When the pan is hot enough for a bead of water to instantly sizzle and evaporate, add just 1 tablespoon of the cooking oil and swirl to coat pan.\r\n\r\n2 Add the shrimp, quickly spreading out around the cooking surface area so that they are not overlapping. Let fry, untouched for 30 seconds. Flip over and let the other side fry for 30 seconds, or until about 80% cooked through. Remove the shrimp from the pan onto a plate, leaving as much oil in the pan as possible.\r\n\r\n3 Turn the heat to medium, let the pan heat up again. Add the eggs, stirring in a quick motion to break up and scramble the eggs. When the eggs are almost cooked through (they should still be slightly runny in the middle), dish out of the pan into the same plate as the cooked shrimp.\r\n\r\n4 Use paper towels to wipe the same wok or sauté pan clean and return to high heat with the remaining 1 tablespoon of cooking oil, swirling to coat. When the oil is very hot, add the green onions and fry until fragrant, about 15 seconds. Add in the rice and stir well to mix in the green onions throughout. Spread the rice all around the wok surface area and let the rice heat up, untouched until you hear the bottoms of the grains sizzle, about 1-2 minutes. Use the spatula to toss the rice, again spreading the rice out over the surface of wok.\r\n\r\n5 Drizzle the soy sauce all around the rice and toss. Add the peas and carrots, the cooked eggs, shrimp and sesame oil, tossing to mix the rice evenly with all of the ingredients. Let everything heat back up again, until the rice grains are so hot they practically dance! Taste and add an additional 1 teaspoon of soy sauce if needed.",
        "ingredients": [
            "8 ounce small raw shrimp, shelled and deveined",
            "1/2 teaspoon kosher salt",
            "freshly ground black pepper",
            "1/2 teaspoon cornstarch",
            "2 tablespoon cooking oil, divided",
            "3 eggs, beaten",
            "2 green onions, minced",
            "4 cup leftover rice, grains separated well",
            "3/4 cup frozen peas and carrots, defrosted",
            "1 tablespoon soy sauce, (use gluten-free soy sauce if you are making a gluten-free version)",
            "1 teaspoon sesame oil"
        ],
        "tags": [
            "seafood",
            "asian",
            "main",
            "untried"
        ],
        "image": "flask/images\\recipe_22.jpg"
    },
    "23": {
        "id": "23",
        "name": "short ribs",
        "source": "Everyday Food Nov 2011",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 18000,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Place onions, garlic, and ginger in a 5- to 6-quart slow cooker. Top with short ribs in a tight layer. In a medium bowl, whisk together brown sugar, soy sauce, vinegar, and Sriracha and add to slow cooker. Cover and cook on high until ribs are almost tender, 4 hours. Add pineapple and cook until pineapple is tender, 1 hour.\r\n\r\nWith a slotted spoon, transfer ribs, pineapple, onions, and ginger to a platter and tent with foil. With a ladle, skim fat from cooking liquid. Serve ribs and pineapple mixture with rice; drizzle with some cooking liquid and sprinkle with scallions.\r\n\r\nCooks Note:\r\nTo store, refrigerate short ribs and cooking liquid in an airtight container for up to 3 days.",
        "ingredients": [
            "2 red onions, cut into 1-inch wedges, root ends left intact",
            "4 clove garlic, smashed",
            "2 tbsp fresh ginger, peeled and thinly sliced",
            "4 lb bone-in beef short ribs (about 6), cut in 3 1/2-inch pieces",
            "1 1/2 cup dark-brown sugar",
            "1 cup low-sodium soy sauce",
            "6 tablespoon rice vinegar",
            "1 tablespoon Sriracha, or other chili sauce",
            "3 cup pineapple, cut into 1-inch cubes (1 pound)",
            "Cooked white rice, for serving",
            "Green onions, chopped, for serving"
        ],
        "tags": [
            "slow_cooker",
            "main",
            "beef",
            "untried"
        ],
        "image": "flask/images\\recipe_23.jpg"
    },
    "24": {
        "id": "24",
        "name": "Salmon",
        "source": "Food Network Magazine May 2011",
        "preptime": 2400,
        "waittime": 3600,
        "cooktime": 900,
        "servings": 8,
        "comments": "May serve 6-8.",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Prepare the salmon: Cook the shallot with the olive oil in a skillet over medium heat, 2 to 3 minutes. Season the salmon with salt and pepper; add to the skillet. Add the wine, cover and cook over low heat until opaque, 3 to 4 minutes per side. Transfer the salmon to a plate and let the pan juices simmer, 2 minutes. Let cool.\r\n\r\nPulse the smoked salmon and butter in a food processor to make a coarse paste. Flake in the cooked salmon; add the pan juices, lemon juice, nutmeg and 1/4 teaspoon salt. Pulse until incorporated. Spoon into a bowl, cover and chill at least 1 hour.\r\n\r\nMake the salad: Toss the tomatoes, sugar and a pinch of salt in a bowl. In a separate bowl, whisk the vinegar, mustard and the 1/2 teaspoon salt, then whisk in the olive oil. Whisk in the cream, tarragon and chives. Toss in the tomatoes and season with salt and pepper. Serve with the salmon rillettes and bread.",
        "ingredients": [
            "1 shallot, minced",
            "2 tablespoon extra-virgin olive oil",
            "1/2 pound salmon fillet, skin removed, cut into 4 pieces",
            "1/4 teaspoon Kosher salt ",
            "Freshly ground pepper",
            "2 tablespoon dry white wine",
            "1/4 pound smoked salmon",
            "1 stick unsalted butter, cut into pieces and softened",
            "1 tablespoon fresh lemon juice",
            "1/4 teaspoon nutmeg, freshly grated",
            "",
            "1 pound grape tomatoes, halved",
            "1/4 teaspoon sugar",
            "1/2 teaspoon Kosher salt",
            "1 tablespoon red wine vinegar",
            "1 tablespoon dijon mustard",
            "1/4 cup extra-virgin olive oil",
            "1/4 cup heavy cream",
            "2 tablespoon fresh tarragon, chopped",
            "1 tablespoon fresh chives, chopped",
            "Freshly ground pepper",
            "Crusty bread, sliced, for serving"
        ],
        "tags": [
            "salmon",
            "party",
            "main",
            "untried"
        ],
        "image": "flask/images\\recipe_24.jpg"
    },
    "25": {
        "id": "25",
        "name": "Oatmeal",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 376,
        "fat": 14,
        "satfat": 2,
        "carbs": 57,
        "fiber": 9,
        "sugar": 21,
        "protein": 11,
        "instructions": "1. To prepare, once oatmeal has been sufficiently cooked, add diced apples and nut butter. Stir for 2-3 minutes.\n2. Serve into a bowl and mix in cinnamon, flax seeds, maple syrup/agave. Stir and enjoy!",
        "ingredients": [
            "1/2 cup quick-cooking oats, cooked to your liking",
            "1/2 apple, diced",
            "1/2 tsp cinnamon",
            "1 tbsp maple syrup",
            "1 tbsp nut butter",
            "1 tbsp ground flax seed"
        ],
        "tags": [
            "breakfast"
        ],
        "image": "flask/images\\recipe_25.jpg"
    },
    "26": {
        "id": "26",
        "name": "Lentils",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. Pour coconut oil and chopped garlic into a saucepan, over medium heat, and sauté the garlic until lightly browned.\n2. Add vegetable broth to the saucepan, allowing everything to simmer for about 5 minutes.\n3. Add 1 cup of water along with lentils and allow to simmer (uncovered) for about 20-30 minutes until they are soft. Add rosemary and drizzle olive oil near the end.",
        "ingredients": [
            "1 cup green lentils, rinsed",
            "2 clove garlic, minced",
            "500 ml vegetable broth",
            "250 ml water",
            "2 tbsp coconut oil",
            "1 tsp fresh or dried rosemary",
            "1 tbsp olive oil"
        ],
        "tags": [
            "lentils",
            "FUF",
            "sides"
        ],
        "image": "flask/images\\recipe_26.jpg"
    },
    "27": {
        "id": "27",
        "name": "Mashed Potatoes",
        "source": "Yuri Elkaim",
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1. In a pot that covers the potatoes with water, bring to a boil. The sweet potatoes are done when they are fork tender.\n2. Mash the potatoes with a hand mixer (or fork or masher) and slowly add in butter and milk until potatoes are creamy and mashed to your preferred consistency. Add a touch of cinnamon for added flavour.",
        "ingredients": [
            "2 large sweet potatoes, peeled and chopped",
            "1/2 stick butter",
            "1 cup milk",
            "salt and pepper, to taste",
            "1 tsp cinnamon (optional)"
        ],
        "tags": [
            "potatoes",
            "FUF",
            "sides"
        ],
        "image": "flask/images\\recipe_27.jpg"
    },
    "28": {
        "id": "28",
        "name": "steak",
        "source": "http://www.foodnetwork.com/recipes/ina-garten/steakhouse-steaks-recipe/index.html",
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat the oven to 400 degrees F.\n\nHeat a large, well-seasoned cast iron skillet over high heat until very hot, 5 to 7 minutes.\n\nMeanwhile, pat the steaks dry with a paper towel and brush them lightly with vegetable oil. Combine the fleur de sel and cracked pepper on a plate and roll the steaks in the mixture, pressing lightly to evenly coat all sides.\n\nWhen the skillet is ready, add the steaks and sear them evenly on all sides for about 2 minutes per side, for a total of 10 minutes.\n\nTop each steak with a tablespoon of butter, if using, and place the skillet in the oven. Cook the steaks until they reach 120 degrees F for rare or 125 degrees F for medium-rare on an instant-read thermometer. (To test the steaks, insert the thermometer sideways to be sure you are actually testing the middle of the steak.)\n\nRemove the steaks to a serving platter, cover tightly with aluminum foil and allow to rest at room temperature for 10 minutes. Serve hot with [Roquefort Cheese Sauce](http://www.xanthir.com/recipes/showrecipe.php?id=62) on the side.",
        "ingredients": [
            "1 tablespoon coarsely cracked black peppercorns",
            "1 tablespoon fleur de sel",
            "2 tablespoon vegetable oil",
            "2 (10-ounce) filet mignon",
            "2 tablespoon unsalted butter, at room temperature, optional",
            "2 servings [Roquefort Cheese Sauce](http://www.xanthir.com/recipes/showrecipe.php?id=62)"
        ],
        "tags": [
            "beef",
            "main"
        ],
        "image": "flask/images\\recipe_28.jpg"
    },
    "29": {
        "id": "29",
        "name": "mac and cheese",
        "source": "Alton Brown",
        "cooktime": 0,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a large pot of boiling, salted water cook the pasta to al dente and drain. Return to the pot and melt in the butter. Toss to coat.\n\nWhisk together the eggs, milk, hot sauce, salt, pepper, and mustard. Stir into the pasta and add the cheese. Over low heat continue to stir for 3 minutes or until creamy.\n\n(This recipe originally called for 6oz milk.  It is reduced as an experiment.)",
        "ingredients": [
            "Fresh black pepper",
            "1 teaspoon kosher salt",
            "1/2 teaspoon hot sauce",
            "4 ounce evaporated milk",
            "2 eggs",
            "4 tablespoon butter",
            "1/2 pound elbow macaroni",
            "1/4 teaspoon dry mustard",
            "10 ounce sharp cheddar, shredded"
        ],
        "tags": [
            "cheese",
            "noodles",
            "main",
            "vegetarian"
        ],
        "image": "flask/images\\recipe_29.jpg"
    },
    "30": {
        "id": "30",
        "name": "French-Onion Stuffed Potatoes",
        "source": "Oct 2011 Food Network Magazine \"50 Stuffed Potatoes\"",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 3600,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Bake potatoes at 400° for 1 hour.  Cook onion with olive oil and salt until caramelized, about 30 minutes.\r\n\r\nScoop flesh out of the potatoes and mash with the onion, beef broth, and 2/3 of the gruyere.  Stuff into the skins, top with more cheese, and broil to melt.",
        "ingredients": [
            "1 large onion, thinly sliced",
            "2 tbsp olive oil",
            "1/4 tsp salt",
            "1/4 cup beef broth",
            "3/4 cup gruyere, shredded",
            "4 russet potatoes"
        ],
        "tags": [
            "potato",
            "dinner",
            "main",
            "vegetarian"
        ],
        "image": "flask/images\\recipe_30.jpg"
    },
    "31": {
        "id": "31",
        "name": "Pasta",
        "source": "napastyle.com",
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 961,
        "fat": 20,
        "satfat": 4,
        "carbs": 157,
        "fiber": 6,
        "sugar": 1,
        "protein": 35,
        "instructions": "Sift flour and semolina into a medium bow.  Mix in salt.  Add eggs and olive oil, and beginning in the center, mix with two fingers in a circular motion until flour is combined with eggs.  Do not overmix.  Remove dough from bowl and gather into a ball.  On a lightly-floured board, knead gently with the heels of your hands, folding dough over onto itself until it forms a smooth mass.  Pat into a ball, flatten slightly, wrap in waxed paper or plastic wrap, and refrigerate for 30 minutes or as long as overnight.\n\nWork on a lightly floured surface.  Keep the dough lightly dusted with flour.  Roll dough into a sheet about 1/16-inch thick.  Gently roll dough up into a cylinder.  With a slicing knife, cut crosswise in 1/4-inch slices.  Dust dough with semolina and unwrap noodles.  Cover with a tea towel until ready to cook.  (The past may be made an hour ahead of time or frozen for up to 1 month.  Defrost in refrigerator.)  Fresh pasta will cook, in boiling salted water, in about 2-3 minutes.",
        "ingredients": [
            "1 cup all-purpose flour",
            "1/2 cup semolina",
            "1/4 tsp salt",
            "2 eggs, at room temperature",
            "2 tsp extra-virgin olive oil"
        ],
        "tags": [
            "noodles",
            "pasta",
            "components",
            "untried"
        ],
        "image": "flask/images\\recipe_31.jpg"
    },
    "32": {
        "id": "32",
        "name": "coconut macaroons",
        "source": "http://www.kingarthurflour.com/recipes/chocolate-dipped-coconut-macaroons-recipe",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "1) Preheat the oven to 350°F. Lightly grease a baking sheet, or line with parchment.\r\n\r\n2) In a medium bowl, mix together the coconut, coconut cream, salt, and coconut flavor, stirring till thoroughly combined.\r\n\r\n3) Add the coconut milk powder, stirring to combine.\r\n\r\n4) Drop the sticky mixture in ping pong-sized balls (about 1 1/2\") onto the prepared baking sheets. It helps to use a tablespoon cookie scoop or small ice cream scoop here. For best results, pack the coconut mixture into the scoop; each ball should weigh about 1 ounce. You can space the balls fairly close together on the baking sheet; they only need about 3/4\" to 1\" between them.\r\n\r\n5) Bake the macaroons for about 10 minutes; they wont brown. You may see the merest hint of brown on top.\r\n\r\n6) Remove from the oven, and cool completely on the baking sheet.\r\n\r\n7) To make the coating, heat the chocolate chips, butter, and corn syrup until the chips are very soft. A microwave oven works well, as does a saucepan set over very low heat.\r\n\r\n8) Dip half of each cooled macaroon into the chocolate. Set the macaroons back on the baking sheet, and allow the chocolate to set completely before serving. To store, place in one layer in a closed container. Theyll keep for 2 or 3 days, but will gradually become less moist as they sit.\r\n\r\nYield: 33 macaroons.\r\n\r\ntips from our bakers\r\nCoconut cream, sweetened condensed coconut milk, is the coconut equivalent of sweetened condensed milk. Substitute sweetened condensed milk, if desired.\r\nCoconut milk powder adds flavor and helps the macaroons hold their nice, smooth shape. Leave it out if you like.",
        "ingredients": [
            "5 cup shredded unsweetened coconut (generous)",
            "1 1/2 cup sweetened coconut cream; one 16-ounce can",
            "1/4 teaspoon salt",
            "1/2 teaspoon coconut flavor, optional",
            "1/3 cup coconut milk powder, optional",
            "",
            "1 1/2 cup semisweet chocolate chips",
            "2 1/2 tablespoon butter or margarine",
            "2 tablespoon light corn syrup or honey"
        ],
        "tags": [
            "cookies",
            "dessert"
        ],
        "image": "flask/images\\recipe_32.jpg"
    },
    "33": {
        "id": "33",
        "name": "Chili",
        "source": "Emeril Lagasse",
        "cooktime": 0,
        "servings": 8,
        "comments": "Nutrition information is without any toppings",
        "calories": 1560,
        "fat": 40,
        "satfat": 0,
        "carbs": 248,
        "fiber": 80,
        "sugar": 56,
        "protein": 72,
        "instructions": "In a large (6qt), heavy pot, heat the oil over medium-high heat. Add the onions, bell peppers, garlic, and serrano peppers, and cook, stirring, until soft, about 3 minutes. \n\nAdd the zucchini and mushrooms, and cook, stirring, until soft and the vegetables give off their liquid and start to brown around the edges, about 6 minutes. Add the chili powder, cumin, salt and cayenne, and cook, stirring, until fragrant, about 30 seconds. \n\nAdd the tomatoes and stir well. Add the beans, tomato sauce, and vegetable stock, stir well, and bring to a boil. Reduce the heat to medium-low and simmer, stirring occasionally, for about 20 minutes.\n\nRemove from the heat and stir in the cilantro and lime juice. Adjust the seasoning, to taste.\n\nTo serve, place 1/4 cup of brown rice in the bottom of each bowl. Ladle the chili into the bowls over the rice. Top each serving with a dollop of sour cream and spoonful of avocado or [guacamole](http://www.xanthir.com/recipes/showrecipe.php?id=28). Sprinkle with [Essence](http://www.xanthir.com/recipes/showrecipe.php?id=id4) and green onions and serve.",
        "ingredients": [
            "2 tablespoon canola oil",
            "1 1/2 cup yellow onions, chopped",
            "1 cup red bell peppers, chopped",
            "2 tablespoon garlic, minced",
            "2 serrano peppers, stemmed, seeded, and minced",
            "1 medium zucchini, stem ends trimmed and cut into small dice",
            "5 large portobello mushrooms, stemmed, wiped clean and cubed",
            "2 tablespoon chili powder",
            "1 tablespooon ground cumin",
            "1 1/4 teaspoon salt",
            "1/4 teaspoon cayenne",
            "4 large tomatoes, peeled, seeded and chopped",
            "2 can black beans, rinsed and drained",
            "1 15oz can tomato sauce",
            "1 cup vegetable stock, or water",
            "1 lime, juiced",
            "1/4 cup cilantro, chopped",
            "",
            "Cooked brown rice, accompaniment",
            "Sour cream or strained plain yogurt, garnish",
            "Diced avocado or guacamole, garnish",
            "Essence, garnish",
            "Chopped green onions, garnish"
        ],
        "tags": [
            "chili",
            "soup",
            "vegetarian",
            "main"
        ],
        "image": "flask/images\\recipe_33.jpg"
    },
    "34": {
        "id": "34",
        "name": "Vinaigrette",
        "source": "Giada De Laurentiis",
        "cooktime": 0,
        "servings": 2,
        "comments": "",
        "calories": 489,
        "fat": 51,
        "satfat": 7,
        "carbs": 16,
        "fiber": 4,
        "sugar": 3,
        "protein": 2,
        "instructions": "In a small bowl, combine the lime zest, lime juice, balsamic vinegar, basil, and cumin. Slowly add the oil, whisking constantly until the mixture thickens. Season with salt and pepper, to taste.",
        "ingredients": [
            "2 limes, zested and juiced",
            "2 tablespoon balsamic vinegar",
            "1/2 cup basil, chopped",
            "1 teaspoon ground cumin",
            "1/4 cup extra-virgin olive oil",
            "Kosher salt and freshly ground black pepper"
        ],
        "tags": [
            "dressing",
            "components"
        ],
        "image": "flask/images\\recipe_34.jpg"
    },
    "35": {
        "id": "35",
        "name": "Lentil Soup",
        "source": "Alton Brown",
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 2259,
        "fat": 43,
        "satfat": 7,
        "carbs": 304,
        "fiber": 144,
        "sugar": 27,
        "protein": 159,
        "instructions": "Place the olive oil into a large 6-quart Dutch oven and set over medium heat. Once hot, add the onion, carrot, celery and salt and sweat until the onions are translucent, approximately 6 to 7 minutes. Add the lentils, tomatoes, broth, coriander, cumin and pepper and stir to combine. Increase the heat to high and bring just to a boil. Reduce the heat to low, cover and cook at a low simmer until the lentils are tender, approximately 35 to 40 minutes. Using a stick blender, puree to your preferred consistency (optional). Serve immediately.",
        "ingredients": [
            "2 tablespoon olive oil",
            "1 cup onion, chopped",
            "1/2 cup carrot, finely chopped",
            "1/2 cup celery, finely chopped",
            "2 teaspoon kosher salt",
            "1 pound lentils, picked and rinsed",
            "1 cup tomatoes, peeled and chopped",
            "2 quart vegetable broth",
            "1/2 teaspoon coriander, freshly ground",
            "1/2 teaspoon cumin, freshly ground and toasted",
            "1/2 teaspoon black pepper, freshly ground"
        ],
        "tags": [
            "soup",
            "lentils",
            "main"
        ],
        "image": "flask/images\\recipe_35.jpg"
    },
    "36": {
        "id": "36",
        "name": "cheese fondue",
        "source": "Cuisinart",
        "preptime": 1500,
        "waittime": 0,
        "cooktime": 0,
        "servings": 8,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Place the grated cheeses in a large bowl and toss to combine. Add the cornstarch and dry mustard and toss to coat the grated cheese completely. Reserve.\r\n\r\nRub the bottom and lower half of the sides Cuisinart® Fondue Pot with the cut sides of the garlic cloves. Add the wine to the Fondue Pot. Turn the temperature to Setting 5 and bring the wine to a strong simmer (bubbling, but not boiling strongly). While stirring constantly with a wooden spoon or non-stick whisk, gradually whisk in the grated cheeses, sprinkling in one handful at a time, and not adding any more cheese until the cheese is completely melted and smooth. The mixture will slowly thicken. When the cheese is completely added, stir in the Kirschwasser and serve. Reduce the temperature setting of the Fondue Pot to Setting 3, the fondue should just simmer, it should never boil.\r\n\r\nThis fondue is traditionally served with cubes of crusty bread. For a change you may also serve blanched to crisp-tender vegetables or cooked, but firm new potatoes.",
        "ingredients": [
            "1 pound Gruyere cheese (not processed), grated ",
            "3/4 pound Emmenthal cheese, grated ",
            "6 teaspoon cornstarch ",
            "1 1/2 teaspoon dry mustard ",
            "1 clove garlic, peeled, cut in half ",
            "2 1/4 cup dry white wine (not chardonnay) ",
            "2 1/2 tablespoon Kirschwasser"
        ],
        "tags": [
            "appetizer",
            "main",
            "fondue",
            "cheese"
        ],
        "image": "flask/images\\recipe_36.jpg"
    },
    "37": {
        "id": "37",
        "name": "Couscous stuffed bellpeppers with basil sauce",
        "source": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/couscous-stuffed-peppers-with-basil-sauce-recipe.html",
        "preptime": 900,
        "waittime": 0,
        "cooktime": 3600,
        "servings": 4,
        "comments": "",
        "calories": 2596,
        "fat": 168,
        "satfat": 60,
        "carbs": 104,
        "fiber": 32,
        "sugar": 48,
        "protein": 60,
        "instructions": "Put an oven rack in the center of the oven. Preheat the oven to 400 degrees F.\r\n\r\nFilling: In a small pot, bring the chicken broth and cumin to a boil over medium-high heat. Remove the pan from the heat and stir in the couscous. Cover the pan until the couscous is tender and all of the liquid has been absorbed, about 5 to 6 minutes. Put the couscous in a large bowl and add the beans, currants, spinach, feta and 1/4 cup olive oil. Season with salt and pepper, to taste. Stir until all the ingredients are combined.\r\n\r\nSlice the tops off the peppers and remove all the ribs and seeds. If necessary, cut a very thin slice from the base to help the peppers stand up. Stuff the peppers with the filling and drizzle the tops with olive oil. Put the peppers in an 8 by 8-inch square baking dish. Fill the baking dish with 3/4-inch hot water and bake until the filling is golden and the peppers are cooked through, about 55 to 60 minutes.\r\n\r\nSauce: In a blender, combine the basil, creme fraiche, olive oil, water, garlic, lemon juice, sugar, salt, and pepper. Blend until smooth. Adjust the seasoning with salt and pepper, to taste.\r\n\r\nRemove the peppers from the oven and arrange on serving plates. Spoon the sauce around the peppers and serve.\r\n\r\n----\r\n\r\nIf using slow-cooker, skip the chicken broth and add the dry couscous and cumin directly to the bowl with the rest of the filling.  Cook in the slow cooker for 4 hours on High.\r\n\r\n----\r\n\r\nIf using poblanos, instead preheat the oven to 475. Halve and clean the poblanos, cover in oil, salt, and pepper, and roast the halves for 11-13 minutes, until slightly softened. Remove from oven, but leave oven on.\r\n\r\nWhen filling is ready, pack into the poblano halves. Return to the oven for 5 minutes, until the peppers are softened. Remove from oven and let sit for two minutes, then drizzle with sauce and serve.",
        "ingredients": [
            "1 cup low-sodium chicken broth",
            "2 teaspoon ground cumin",
            "3/4 cup couscous",
            "1 cup chickpeas, rinsed and drained",
            "1/4 cup dried currants",
            "1 packed cup baby spinach leaves, chopped",
            "4 oz feta cheese, crumbled",
            "1/4 cup extra-virgin olive oil, plus more for drizzling",
            "Kosher salt and freshly ground black pepper",
            "4 medium red bell peppers or poblano peppers, see alternate cooking instructions",
            "Hot water, as needed",
            "",
            "1 packed cup fresh basil leaves",
            "1/2 cup creme fraiche",
            "3 tablespoon extra-virgin olive oil",
            "1 tablespoon water",
            "1 garlic clove, coarsely chopped",
            "2 teaspoon fresh lemon juice",
            "1/4 teaspoon sugar",
            "1/4 teaspoon salt, plus extra, as needed",
            "1/4 teaspoon freshly ground black pepper, plus extra, as needed"
        ],
        "tags": [
            "vegetarian",
            "main",
            "slow_cooker"
        ],
        "image": "flask/images\\recipe_37.jpg"
    },
    "38": {
        "id": "38",
        "name": "Spicy Rice Casserole",
        "source": "Betty Crocker",
        "cooktime": 1500,
        "servings": 2,
        "comments": "",
        "calories": 1294,
        "fat": 46,
        "satfat": 12,
        "carbs": 186,
        "fiber": 14,
        "sugar": 26,
        "protein": 44,
        "instructions": "Preheat oven to 425 degrees. (If not already done, cook rice according to package directions. Ideally, use a rice cooker earlier in the day.)\n\nMix rice, oats, onion, bread crumbs, milk, basil, oregano, cayenne, and egg.  Season to taste.  Press mixture into small baking dish.  Bake for 25 minutes, then let rest for 5 minutes out of the oven.\n\nAs the rice goes into the oven, make the marinara sauce. Once the marinara is simmering, make the breadcrumbs.\n\nServe rice, topped with marinara and then panko.",
        "ingredients": [
            "1 cup brown rice (uncooked)",
            "1/2 cup quick-cooking oats",
            "1/2 cup onion, chopped",
            "1/4 cup panko",
            "1/4 cup milk",
            "1 tbsp italian seasoning",
            "1/8 tsp cayenne pepper",
            "1 large egg, beaten",
            "salt and pepper",
            "",
            "4 serving [marinara sauce](http://www.xanthir.com/recipes/showrecipe.php?id=id34)",
            "",
            "2 servings [toasted panko breadcrumbs](https://www.xanthir.com/recipes/showrecipe.php?id=id631)"
        ],
        "tags": [
            "vegetarian",
            "rice",
            "main"
        ],
        "image": "flask/images\\recipe_38.jpg"
    },
    "39": {
        "id": "39",
        "name": "Mayonnaise",
        "source": "http://www.foodnetwork.com/recipes/alton-brown/mayonnaise-recipe.html",
        "preptime": 0,
        "waittime": 0,
        "cooktime": 600,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a glass bowl, whisk together egg yolk and dry ingredients. \r\n\r\nCombine lemon juice and vinegar in a separate bowl then thoroughly whisk half into the yolk mixture. \r\n\r\nStart whisking briskly, then start adding the oil a few drops at a time until the liquid seems to thicken and lighten a bit, (which means youve got an emulsion on your hands). Once you reach that point you can relax your arm a little (but just a little) and increase the oil flow to a constant (albeit thin) stream. Once half of the oil is in add the rest of the lemon juice mixture.\r\n\r\nContinue whisking until all of the oil is incorporated. Leave at room temperature for 1 to 2 hours then refrigerate for up to 1 week.\r\n\r\n1 serving makes ~1 cup of mayo.",
        "ingredients": [
            "1 egg yolk",
            "1/2 tsp salt",
            "1/2 tsp dry mustard",
            "2 pinches sugar",
            "2 tsp lemon juice",
            "1 tbsp white wine vinegar",
            "1 cup oil, safflower or corn"
        ],
        "tags": [
            "components"
        ],
        "image": "flask/images\\recipe_39.jpg"
    },
    "40": {
        "id": "40",
        "name": "Coconut shrimp with tropical rice",
        "source": "Food Network Magazine Jan/Feb 2015",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 600,
        "servings": 4,
        "comments": "",
        "calories": 1428,
        "fat": 36,
        "satfat": 24,
        "carbs": 156,
        "fiber": 8,
        "sugar": 0,
        "protein": 116,
        "instructions": "Preheat the oven to 425°. Line a rimmed baking sheet with foil and set a wire rack on top; coat with cooking spray. \r\n\r\nCombine 1 cup water, the coconut water, and rice in a medium saucepan and bring to a boil. Reduce the heat to medium low; cover and simmer 8 minutes. Remove from the heat; add the carrots, red onion, lime zest, half the lime juice, salt, and pepper (do not stir). Cover and let sit 10 minutes, then fluff with a fork to combine.\r\n\r\nMeanwhile, season the shrimp with salt and pepper. Beat the egg and 2 tablespoons water in a bowl. Combine the coconut and panko in another bowl. Dip the shrimp in the egg mixture, then the coconut panko mixture, gently pressing to adhere; transfer to the prepared rack. Bake until the shrimp are cooked through, about 10 minutes, then turn on the broiler and broil the shrimp until golden brown, 1 to 2 minutes. \r\n\r\nAdd the cilantro to the rice mixture and toss, then top with shrimp and remaining lime juice.",
        "ingredients": [
            "1 cup water",
            "3/4 cup coconut water",
            "3/4 cup basmati or other long-grain rice",
            "1 lime, zested and juiced separately",
            "1/2 cup carrots",
            "2 tablespoon red onion, finely chopped",
            "1/4 teaspoon kosher salt",
            "freshly ground pepper",
            "",
            "1 pound large shrimp, peeled and deveined",
            "1 large egg",
            "1 cup sweetened shredded coconut",
            "3/4 cup panko breadcrumbs",
            "2 tablespoon cilantro, chopped"
        ],
        "tags": [
            "seafood",
            "main"
        ],
        "image": "flask/images\\recipe_40.jpg"
    },
    "41": {
        "id": "41",
        "name": "Shakshuka with chickpeas",
        "source": "Food Network Magazine March 2015",
        "preptime": 1200,
        "waittime": 0,
        "cooktime": 1200,
        "servings": 4,
        "comments": "",
        "calories": 1808,
        "fat": 76,
        "satfat": 16,
        "carbs": 184,
        "fiber": 32,
        "sugar": 0,
        "protein": 96,
        "instructions": "Heat the olive oil in a large skillet over medium heat. Add the onion and garlic and cook, stirring, until softened, about 5 minutes. Add the chickpeas, cumin and a pinch each of salt and pepper; stir well to coat. Add the tomatoes and water. Bring to a simmer and cook, stirring occasionally, until the sauce thickens, about 20 minutes.\r\n\r\nMake wells in the sauce, one per egg, and crack an egg into each. Sprinkle the eggs with herbs, and lightly season. Cover and cook until whites are just set but yolks are still runny, about 5 minutes. (The eggs will continue cooking after you remove them from the oven.)\r\n\r\nMeanwhile, divide the pitas into eighths and open up the halves. Spray with a thin layer of olive oil, then season with salt and zaatar. Toast at 375F for 6-8 minutes, until crispy.\r\n\r\nCombine the yogurt, hummus and a pinch of salt in a small bowl. \r\n\r\nServe the shakshuka in bowls, ideally not breaking the yolks. Top with hummus sauce, and add chips on the side.",
        "ingredients": [
            "2 tablespoon extra-virgin olive oil",
            "1 onion, chopped",
            "3 clove garlic, thinly sliced",
            "1 can chickpeas, drained and rinsed",
            "2 teaspoon cumin",
            "Kosher salt and freshly ground pepper",
            "2 14.5oz cans petite diced tomatoes with green chiles",
            "1/3 cup water",
            "8 eggs",
            "2 tablespoon cilantro, chopped",
            "",
            "2 pieces pita bread",
            "1 tbsp zaatar seasoning",
            "1/2 cup plain nonfat Greek yogurt",
            "1/2 cup hummus"
        ],
        "tags": [
            "vegetarian",
            "israeli",
            "main"
        ],
        "image": "flask/images\\recipe_41.jpg"
    },
    "42": {
        "id": "42",
        "name": "Apple-Brie Panini",
        "source": "Food Network Magazine",
        "cooktime": 0,
        "servings": 1,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Preheat a skillet with 1 tablespoon butter (or oil) on medium-low.\n\nSpread Dijon mustard on the inside of a split piece of baguette. Fill with the brie and apple slices.\n\nAdd sandwich to skillet, the press a heavy pan on top to weigh it down. Cook until golden and crisp, 3 to 4 minutes per side. Add more butter to the skillet, if needed, for second side.",
        "ingredients": [
            "Dijon mustard",
            "Baguette",
            "2 oz brie cheese, sliced",
            "1/4 green apple, thinly sliced",
            "2 tablespoon unsalted butter"
        ],
        "tags": [
            "sandwich",
            "main",
            "test"
        ],
        "image": "flask/images\\recipe_42.jpg"
    },
    "43": {
        "id": "43",
        "name": "Shredded Green Beans",
        "source": "Super Natural Cooking by Heidi Swanson",
        "cooktime": 180,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Slice the beans on a diagonal into roughly 1/8-inch pieces. If you are using a food processor, do them a handful at a time. Either way, the result should be tiny, angular zeroes.\n\nHeat the olive oil in a large skillet over medium-high heat. Add the beans and stir until coated with oil, then add the water. Cover and cook 2 or 3 minutes, until the beans are brightly colored and tender; give the pan a good shake midway through to ensure even cooking. Remove from the heat and stir in the zests and half of the chives. Season to taste with salt and pepper and serve garnished with the remaining chives.",
        "ingredients": [
            "3/4 pound green beans, tops and tails trimmed",
            "2 tablespoon extra-virgin olive oil or clarified butter",
            "2 tablespoon water",
            "1 lemon, zested",
            "1 lime, zested",
            "1/4 cup chives, chopped",
            "Salt and freshly ground pepper"
        ],
        "tags": [
            "vegetables",
            "vegetarian",
            "sides"
        ],
        "image": "flask/images\\recipe_43.jpg"
    },
    "44": {
        "id": "44",
        "name": "Hot Cocoa",
        "source": "Food Network Magazine",
        "cooktime": 300,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Prepare mix ahead of time. One serving is 1/4 cup mix per cup of milk.\n\nBring milk to a simmer in a saucepan over medium heat. Whisk cocoa/sugar mix into the milk. Add the chopped chocolate and reduce heat to low and simmer, stirring, until the chocolate melts and the cocoa is thick, about 2 minutes. Divide among mugs and garnish each with homemade marshmallows or whipped cream.",
        "ingredients": [
            "3/4 cup sugar",
            "1/2 cup unsweetened cocoa powder",
            "1 tsp vanilla extract",
            "1/4 tsp salt",
            "",
            "4 cup milk",
            "4 oz chocolate, chopped fine"
        ],
        "tags": [
            "drink",
            "chocolate"
        ],
        "image": "flask/images\\recipe_44.jpg"
    },
    "45": {
        "id": "45",
        "name": "Pesto Orzo with Peas",
        "source": "Food Network Magazine - 50 Things to Make with Pesto",
        "cooktime": 0,
        "servings": 4,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Cook pancetta in a skilled with olive oil until crisp.  Remove with slotted spoon.\n\nMeanwhile, bring 1 quart of water to a boil. Add 1 tbsp salt and orzo. Cook about 5 minutes or until al dente.\n\nAdd frozen peas and water to the skillet; simmer until tender (about 5 minutes). Drain and return to skillet.\n\nStir in pesto, orzo, pancetta, and parmesan, and heat through.",
        "ingredients": [
            "4 oz pancetta, diced",
            "12 oz frozen peas",
            "1 cup water",
            "4 oz pesto",
            "1 cup orzo, uncooked",
            "2 tbsp Parmesan, grated"
        ],
        "tags": [
            "peas",
            "pasta",
            "main"
        ],
        "image": "flask/images\\recipe_45.jpg"
    },
    "46": {
        "id": "46",
        "name": "Roasted potatoes and tomatoes",
        "source": "Food Network Magazine May 2011",
        "cooktime": 1500,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "Put a baking sheet in the oven and preheat to 450.\n\nCut potatoes lengthwise into eighths. Toss with olive oil, tomatoes, rosemary, garlic cloves, salt and pepper. Put cut-side down on the hot baking sheet and roast 15 minutes. Flip the mixture and roast 10 more minutes.",
        "ingredients": [
            "1 1/2 pound red potatoes",
            "2 tbsp olive oil",
            "1 pint grape tomatoes",
            "3 sprig rosemary",
            "3 garlic cloves, smashed",
            "salt and pepper"
        ],
        "tags": [
            "sides",
            "potatoes"
        ],
        "image": "flask/images\\recipe_46.jpg"
    },
    "47": {
        "id": "47",
        "name": "Cannoli",
        "source": "http://www.food.com/recipe/cannoli-95546",
        "preptime": 3600,
        "waittime": 0,
        "cooktime": 2700,
        "servings": 24,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "To make shells, mix flour, sugar and salt in a bowl.\r\n\r\nCut in butter.\r\n\r\nAdd egg yolks; stir with a fork.\r\n\r\nStir in wine, 1 tablespooon at a time, with a fork until dough clings together.\r\n\r\nForm a ball with the dough and let stand for 30 minutes.\r\n\r\nRoll dough almost paper thin, on a well-floured surface.\r\n\r\nUsing the rim of a margarita glass (about 3-4 inches across), make circle imprints into rolled dough.\r\nUsing a paring knife, make sure circles are cut all the way through.\r\n\r\nRoll each circle of dough around a metal cannoli tube, overlaping the ends and press to seal, flaring out the edges slightly.\r\n\r\nFry one or two at a time in hot melted shortening (about 360°F) for approximately 1 minute, turning to brown all sides.\r\n\r\nRemove from hot grease and drain on paper towels, seam side down.\r\n\r\nLet cool a minute or two before trying to remove metal tube.\r\n\r\nTo remove the tube hold cannoli shell down on the paper towel and carefully slide the tube out one end.\r\n\r\nLeave cannoil shells on paper towel, seam side down to cool completely.\r\n\r\n~NOTE~Shells can be stored in airtight containers and made several days prior to filling.\r\n\r\nFor filling, drain ricotta cheese over cheesecloth if ricotta is watery.\r\n\r\nCombine ricotta cheese, powdered sugar, and vanilla extract until combined.\r\n\r\nSqueeze Maraschino cherries with paper towels to remove all liquid.\r\n(If you dont squeeze them good, you will have a pink water filling!).\r\n\r\nStir in cherries and chocolate chips into the ricotta mixture, being careful not to over mix.\r\n\r\nFor a lighter filling, you may whip 1 cup of heavy whipping cream to form stiff peaks, and fold into filling mixture at this step.\r\n\r\nChill filling for about 30 minutes before piping into cooled cannoli shells.\r\n\r\nYou may garnish the cannoli by sprinkling powdered sugar on top.\r\n\r\nWhipped cream, a cherry, and shaved chocolate can also be used to garnish the top.\r\n\r\nKeep refrigerated until time of serving.",
        "ingredients": [
            "4 cup all-purpose flour, sifted",
            "2 tablespoon sugar",
            "1⁄4 teaspoon salt",
            "3 tablespoon butter, softened",
            "2 egg yolks",
            "3⁄4 cup white wine",
            "canola oil or shortening, for frying",
            "",
            "4 cup whole milk ricotta cheese",
            "1 1⁄2 cups powdered sugar",
            "1 tablespoon vanilla extract",
            "1⁄3 cup finely chopped maraschino cherry",
            "1⁄4 cup semisweet mini chocolate chips",
            "1 cup heavy whipping cream, optional"
        ],
        "tags": [
            "dessert"
        ],
        "image": "flask/images\\recipe_47.jpg"
    },
    "48": {
        "id": "48",
        "name": "Spiced Apple Sauce",
        "source": "Cook with Jamie by Jamie Oliver",
        "cooktime": 0,
        "servings": 4,
        "comments": "Substitute 1 lemon for 1/2 orange",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "In a small saucepan gently melt the butter for a minute with the orange zest and juice, the sugar, cinnamon, grated nutmeg and cloves. Stir until the butter foams, then stir in the apples. Place a lid on top and cook for 15-20 minutes on a medium to low heat until you have a soft, sludgy sauce. Taste and add a bit more sugar if you want. Serve warm or room temperature.",
        "ingredients": [
            "1 tbsp unsalted butter",
            "1/2 orange, zested and juiced",
            "2 tbsp sugar",
            "1/4 tsp ground cinnamon",
            "1/4 nutmeg, grated",
            "1/4 tsp ground cloves",
            "2 good eating apples, peeled, cored and chopped into 1 inch dice",
            "1 cooking apple, peeled, cored and chopped into 1 inch dice"
        ],
        "tags": [
            "sides",
            "apple"
        ],
        "image": "flask/images\\recipe_48.jpg"
    },
    "49": {
        "id": "49",
        "name": "Godiva Angel Pie",
        "source": "everyrecipe.com",
        "cooktime": 0,
        "servings": 12,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "TO MAKE SHELL: Preheat oven to 300 degrees. In mixer bowl, beat egg whites until foamy. Beat in salt and cream of tartar and beat until soft peaks form. Add sugar, a tablespoon at a time, beating after each addition. Continue until very stiff peaks form. Fold in nuts and vanilla. Lightly butter a metal 8-inch pie plate. (Do NOT use glass.) Spoon meringue into pan lightly, building up the edges to come at least 1/2 inch above the side of the pan. Bake in preheated 300 degree oven for 35 to 40 minutes until light brown. Cool completely before adding filling. TO MAKE FILLING: Melt chocolate and water in a pan over hot, but not boiling, water, stirring occasionally, to blend. Add vanilla and chocolate mixture (cooled) to whipped cream and pile into meringue shell, swirling top with spatula. Be sure to cool the chocolate mixture before adding to the whipped cream. If it is too warm, the mixture will thin out. If this happens, chill until it is thick enough to put in shell.",
        "ingredients": [
            "4 (1 oz.) squares Godiva cooking chocolate or 4 oz. Bakers German sweet chocolate",
            "1/2 tsp vanilla",
            "1 cup pecans, finely chopped",
            "1/2 cup sugar",
            "1/8 tsp cream of tartar",
            "1/8 tsp salt",
            "2 egg whites, at room temperature",
            "3 tbsp water",
            "1 tsp vanilla",
            "1 cup heavy cream, whipped"
        ],
        "tags": [
            "chocolate",
            "dessert",
            "pie",
            "untried"
        ],
        "image": "flask/images\\recipe_49.jpg"
    },
    "50": {
        "id": "50",
        "name": "Oregano Marinated Chicken",
        "source": "http://www.foodnetwork.com/recipes/dave-lieberman/greek-salad-with-oregano-marinated-chicken-recipe2/index.html",
        "cooktime": 900,
        "servings": 6,
        "comments": "",
        "calories": 0,
        "fat": 0,
        "satfat": 0,
        "carbs": 0,
        "fiber": 0,
        "sugar": 0,
        "protein": 0,
        "instructions": "To marinate the chicken: In a non-reactive dish, combine the lemon juice, olive oil, oregano, salt, and pepper and mix together. Add the chicken breasts to the dish and rub both sides in the mixture. Cover the dish with plastic wrap and let marinate in the refrigerator for at least 30 minutes and up to 4 hours.\n\nTo cook the chicken: Heat a nonstick skillet or grill pan over high heat. Add the chicken breasts and cook, turning once, until well browned, about 4 to 5 minutes on each side or until cooked through. Let the chicken rest on a cutting board for a few minutes before slicing it into thin strips.",
        "ingredients": [
            "4 (6 to 7-ounce) boneless skinless chicken breasts",
            "10 grinds black pepper",
            "1/2 tsp salt",
            "2 tablespoon extra-virgin olive oil",
            "1 teaspoon dried oregano",
            "1 lemon, juiced"
        ],
        "tags": [
            "main",
            "chicken"
        ],
        "image": "flask/images\\recipe_50.jpg"
    }
}